Repository: p-kaczynski/SecretSanta
Catalog: SecretSanta/Resources/Global.*.resx
Languages: pl

# AbandonedUsers
source: Users that could not be matched
pl: Użytkownicy których nie udało się uwzględnić

# AccountRemove
source: Remove Account
pl: Usuń się

# AccountRemoveIntro
source: You are about to delete your account. This action cannot be reversed and you will have to register again. Are you sure?
pl: Zamierzasz usunąć swoje konto. Proces ten nie może być odwrócony. Niezbędna będzie ponowna rejestracja. Czy jesteś pewien kurde xD?

source: Account Settings
pl: Ustawienia konta

source: Address Line 1
pl: Pierwsza linia adresu

# AddressLine1_Required
source: Address Line 1 is required for postal purposes
pl: Pierwsza linia adresu jest wymagana w celach wysyłkowych

# AddressLine1_TooLong
source: Address Line 1 is limited to 200 characters
pl: Liczba znaków pierwszej linii adresu jest ograniczona do 200.

source: Address Line 2
pl: Druga linia adresu

# AddressLine2_TooLong
source: Address Line 2 is limited to 200 characters
pl: Liczba znaków drugiej linii adresu jest ograniczona do 200.

# AdminIndex
source: Administrators
pl: Administratorzy

# AdminUnconfirmed
source: Awaiting confirmations
pl: Oczekuje na potwierdzenie

# AdminUser
source: Registered Users
pl: Użytkownicy

source: Admin User Name
pl: Nazwa administratora

# AdminUserName_Invalid
source: The user name for admin account must be alphanumerical (no whitespace or special characters)
pl: Nazwa konta administratora musi być alfanumeryczna (bez białych i specjalnych znaków)

# AdminUserName_Required
source: The user name for admin account is required
pl: Nazwa konta administratora jest niezbędna

# AdminUserName_TooLong
source: The user name for admin account is limited to 200 characters
pl: Nazwa konta administartora jest ograniczona do 200 znaków.

# Admin_Confirmed
source: Your account has been approved by an admin.
pl: Twoje konto zostało zatwierdzone przez administratora.

# Admin_NotConfirmed
source: Your account has not been yet approved by an admin.
pl: Twoje konto nie zostało jeszcze zatwierdzone przez administratora.

# AllReady
source: You are all done - now wait for the assignment of the recepient of your gift.
pl: Wszystko gotowe! Teraz czekaj na przypisanie Kurdona.

# AllUsersMatched
source: All users were matched!
pl: Wszyscy użytkownicy zostali sparowani

# Assignment
source: Assign recepients
pl: Przypisz odbiorców

source: Assignment completed
pl: Przypisania Kurdonów ukończone

# AssignmentDone
source: The assignment has been already done.
pl: Kurdoni zostali sobie przypisani.

source: Assignments
pl: Przypisania

# Button_Submit
source: Submit
pl: Wyślij

source: City
pl: Miasto

# City_Required
source: City (or town, village etc.) is required for postal purposes
pl: Nazwa miasta jest wymagana w celach wysyłkowych

# City_TooLong
source: City is limited to 200 characters
pl: Nazwa miasta

source: Close registration
pl: Zamknij rejestrację

source: Confirmation
pl: Potwierdzenie

# ConfirmationEmailSent
source: Registration succesful. Email with a confirmation link was sent to
pl: Rejestracja zakończona powodzeniem. Email z linkiem potwierdzającym został wysłany do

# CookieBanner_Accept
source: I understand and accept usage of cookies
pl: Rozumiem i zgadzam się na ciasteczka.

# CookieBanner_Message
source: The law requires to inform users about usage of cookies, which is just as universal as the internet itself. Click that you understand and accept. Also, The EU should be destroyed.
pl: Prawo wymaga aby poinformować użytkowników o tym, że strona używa ciasteczek - jak każda inna w całym internecie. Kliknij, że rozumiesz i się zgadzasz, oraz, że Unia Europejska to banda idiotów.

source: Country
pl: Kraj

# Country_Required
source: Country is required for postal purposes
pl: Nazwa kraju jest wymagana w celach wysyłkowych

# Country_TooLong
source: Country is limited to 200 characters
pl: Nazwa kraju jest ograniczona do 200 znaków

# CreateAdmin
source: Create admin account
pl: Stwórz konto administratora

source: Display Name
pl: Nazwa wyświetlana

# DisplayName_Required
source: The display name is required
pl: Nazwa wyświetlana jest wymagana

# DisplayName_TooLong
source: The display name is limited to 200 characters
pl: Nazwa wyświetlana jest ograniczona do 200 znaków

source: Edit admin
pl: Edytuj administratora

# Email
source: Email Address
pl: Adres email

# EmailConfirmation_TokenInvalid
source: The confirmation token is invalid.
pl: Podany token jest nieprawidłowy lub wygasł. Skontaktuj się z administratorem.

# EmailConfirmedMessage
source: Your email has been confirmed.
pl: Twój email został zatwierdzony

# EmailTaken
source: This email has been already registered
pl: Ten email jest już zarejestrowany

# Email_Confirmed
source: Your email has been confirmed.
pl: Twój email został potwierdzony

# Email_HelpText
source: A valid email address
pl: Poprawny adres email

# Email_Invalid
source: The email is invalid
pl: Adres email nieprawidłowy

# Email_NotConfirmed
source: Your email address has not been yet confirmed.
pl: Twój adres email oczekuje na potwierdzenie

# Email_PasswordReset_Body
source: Hi {0}! Click on following link to go to your password reset form. If you have not requested a password reset, you can safely delete this email. The token will be valid for {2} minutes. {1}
pl: Cześć {0}! Kliknij w podany link aby przejść do formularza resetującego hasło: {1} Jeżeli nie chciałeś resetować hasła możesz spokojnie usunąć tą wiadomość. Token będzie ważny przez {2} minut.

# Email_PasswordReset_Subject
source: Secret Santa Password Reset
pl: Zmiana hasła w Kurde Mikołajkach

# Email_Required
source: Email is required to send the confirmation and details of a person chosen for you
pl: Email jest wymagany do wysłania potwierdzenia i informacji o dobranym Kurdonie.

# Email_ResendConfirmatioon
source: Resend confirmation email
pl: Wyśli ponownie wiadomość potwierdzającą

# Email_SendingFailure
source: We were unable to send an email. Please wait 15 minutes and try again, and if you see this message again contact an administrator.
pl: Nie udało się wysłać wiadomości. Poczekaj proszę 15 minut i spróbuj ponowanie. Jeżeli ta wiadomość pojawi się ponownie, skontaktuj się z administratorem.

# Email_Verification_Body
source: Hi {0}! To complete your registration please open following link in your browser: {1}
pl: Cześć {0}! Aby potwierdzić swój email kliknij w poniższy link: {1}

# Email_Verification_Subject
source: Secret Santa account creation confirmation
pl: Potwierdzenie adresu email Kurde Mikołajek

# FacebookURL
source: URL to the Facebook profile
pl: Odnośnik do profilu na Facebooku

# FacebookURL_HelpText
source: A valid URL to your Facebook profile (including http:// or https://)
pl: Poprawny adres do twojego profilu na facebooku

# FacebookURL_Invalid
source: The URL is invalid
pl: Odnośnik jest nieprawidłowy

# FacebookURL_Required
source: URL to the Facebook profile is required for verification
pl: Odnośnik jest wymagany do weryfikacji

source: Full Name
pl: Pełna nazwa (do wysyłki)

# FullName_Required
source: Your full name is required for postal purposes
pl: Pełne imię jest wymagane do wysyłki

# FullName_TooLong
source: The full name is limited to 200 characters
pl: Pełne imię jest ograniczone do 200 znaków

source: Giver
pl: Nadawca

source: Go back
pl: Powrót

# Hello
source: Witaj
pl: śWitaj

# InitialSetup
source: Setup
pl: Ustawienia

# Intro
source: Lorem ipsum dolor sit amet, consectetur adipiscing elit. Donec convallis nisl nec molestie suscipit. Pellentesque finibus pretium iaculis. Mauris tempus dui at odio feugiat, non hendrerit lorem tincidunt. Aenean id tincidunt ex. Suspendisse gravida ornare turpis sit amet ultricies. Lorem ipsum dolor sit amet, consectetur adipiscing elit. Mauris pellentesque nisi nec tempus vestibulum. Vestibulum ipsum enim, cursus vitae eros ac, ullamcorper sodales purus. Donec eget nisl pellentesque, eleifend lectus quis, lobortis leo.
pl: Zażółć gęślą jaźń

# LoginName
source: Email or admin login
pl: E-mail lub login admina

# Login_Invalid
source: Login or password invalid
pl: Login albo hasło są niepoprawne

# Login_LockedOut
source: Account is locked
pl: Konto zablokowane

source: Logout
pl: Wyloguj

# Menu_ForgotPassword
source: Have you forgotten your password?
pl: Kurdonie, czyżbyś zapomniał swojego hasła?

# Message_CannotRemoveAccountAfterAssignment
source: The assignment has been already done - you cannot remove your account!
pl: Nie możesz usunąć konta po przypisaniu Kurdona!

# Message_Error
source: Something went wrong!
pl: Coś poszło nie tak. Spróbuj jeszcze raz lub skontaktuj się z adminem.

# Message_ResendConfirmation
source: The confirmation link was sent to your email address.
pl: Link potwierdzający został wysłany na twój email

source: Note
pl: Notka dla Kurdemikołaja

# NothingToConfirm
source: No users require confirmation!
pl: Brak użytkowników do zatwierdzenia!

# NoUsers
source: No one has yet registered
pl: Nikt jeszcze się nie zarejestrował

source: Open registration
pl: Otwórz rejestrację

source: Password
pl: Hasło

# PasswordConfirmation_NoMatch
source: The password confirmation does not equal password.
pl: Powtórzone hasło nie jest identyczne z uprzednio podanym.

# PasswordReset_Sent
source: If there is an account registered with provided email address, an email with password reset link was sent to it.
pl: Jeżeli istnieje konto z podanym adresem email, został na niego wysłany link do zresetowania hasła.

# PasswordReset_Success
source: Password reset succesfully
pl: Pomyślnie zresetowano hasło

# PasswordReset_Title
source: Reset password
pl: Resetuj hasło

# PasswordReset_TokenInvalid
source: The password reset token is invalid or has expired.
pl: Token resetu hasła jest niepoprawny albo wygasł

# PasswordReset_Token_Display
source: Password reset token
pl: Token resetu hasła

# Password_HelpText
source: Password must be minimum 10 characters long, three characters of (lowercase letter, uppercase letter, digit, special character) and cannot be a common pattern. See <a href="https://www.owasp.org/index.php/Authentication_Cheat_Sheet#Password_Complexity">OWASP recommendation</a> for details.
pl: Hasło musi mieć co najmniej 8 znaków, conajmniej trzy z: wielka litera (A), mała litera(a), cyfra(1), inny znak($)), znaki nie mogą się powtarzać więcej niż 3 razy (aaa), oraz nie może być trywialne do złamania ze względu na znany "wzór". Przeczytaj <a href="https://www.owasp.org/index.php/Authentication_Cheat_Sheet#Password_Complexity">OWASP recommendation</a> aby dowiedzieć się dlaczego istnieją takie wymagania.

# Password_Invalid
source: Password does not meet the complexity requirements.
pl: Hasło jest niezgodne z wymaganiami.

source: Postal Code
pl: Kod pocztowy

# PostalCode_Required
source: Postal Code is required for postal purposes
pl: Kod pocztowy jest wymagany do wysyłki

# PostalCode_TooLong
source: Postal Code is limited to 32 characters
pl: Kod pocztowy jest ograniczony do 32 znaków

source: Privacy Policy
pl: Polityka Prywatności

source: Reason
pl: Powód

# RecepientAssigned
source: You have been assigned a recepient! Check the information below and send your gift as soon as you can!
pl: Przypisano Ci Kurdona! Sprawdź poniższe informacje i wyślij prezent jak najszybciej!

# RecepientLeftNote
source: The recipient also left a note:
pl: Uwagi od odbiorcy:

source: Recipient
pl: Adresat

source: Registration
pl: Rejestracja

# RegistrationClosed
source: The registrations has been closed.
pl: Rejestracja została zamknięta

# RegistrationOpen
source: Is registration open?
pl: Czy rejestracja jest otwarta?

# Registration_FieldsWithAsterisk
source: Fields with asterisk (*) are required.
pl: Pola oznaczone gwiazdką są obowiązkowe.

# Registration_Form_Agreement
source: I agree
pl: Zgadzam się

# Registration_Form_Agreement_Error
source: You must agree to the privacy policy.
pl: Musisz zgodzić się na politykę prywatności.

# Registration_Form_Agreement_HelpText
source: I understand and agree to the {0}
pl: Rozumiem i zgadzam się na {0} oraz {1}

source: Remove User
pl: Usuń użytkownika

# RemoveUserIntro
source: You are about to remove the following user. This action cannot be reversed and the user will have to register again.
pl: Zamierzasz usunąć użytkownika. Proces jest nieodwracalny i niezbędna będzie ponowna rejestracja.

# SentAbroad
source: I agree to send gift abroad (be aware of potential costs, which might be very high!)
pl: Zgadzam się na wysyłkę za granicę (będąc świadom dodatkowych, możliwie wysokich kosztów)

source: Setting Name
pl: Ustaw nazwę

source: Settings
pl: Ustawienia

# SettingValue
source: Current Value
pl: Obecna wartość

# SiteName
source: Secret Santa
pl: Kurde Mikołajki

# SystemMessage
source: Information
pl: Informacje

# User_Edit_EmailSent
source: Update succesful. Because you have changed your email, a confirmation link has been sent to provided address: {0}. You must also sign-in again!
pl: Dane zostały uaktualnione. Ponieważ zmieniłeś adres e-mail na podany adres: {0} została wysłana wiadomość z linkiem potwierdzającym. Dodatkowo będziesz musiał zalogować się ponownie.

# User_Edit_Title
source: Edit Account
pl: Edycja danych

# User_Edit_Warning
source: Warning, changing your data will revoke the admin confirmation of your account. Also, changing your email address will revoke the email confirmation!
pl: Uwaga, wysłanie tego formularza unieważni twoją akceptację przed administratora! Dodatkowo, jeśli zmienisz swój email, będziesz musiał go potwierdzić ponownie.

# User_View_AdminConfirmed
source: Confirmed by admin
pl: Zatwierdzone przez admina

# User_View_Edit
source: Edit account
pl: Edycja danych

# User_View_EmailConfirmed
source: Email confirmed
pl: Email potwierdzony

# Warning_TestMode
source: Warning! The app is runing in test mode. All data will be purged before full launch.
pl: Uwaga! Aplikacja działa w trybie testowym. Wszystkie dane zostaną wyjebawczanione przed oficjalnym uruchomieniem.

source: Will Send Abroad
pl: Mogę wysłać za granicę
